# Используем Python для работы с базой данных SQLite

<a target="_blank" href="https://colab.research.google.com/github/sozykin/middle_python/blob/main/04/04_pandas.ipynb">
  <img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/>
</a>

In [1]:
import sqlite3

## Установка соединения

In [90]:
# Создание базы данных в файле test.db 
connection = sqlite3.connect('test.db')

In [99]:
# Создаем курсор
cursor = connection.cursor()

## Создание таблицы для данных

In [33]:
# Оператор SQL для создания таблицы
create_names_table = """
CREATE TABLE IF NOT EXISTS names(
    id INTEGER,
    name TEXT,
    number_of_persons INTEGER,
    global_id INTEGER,
    year INTEGER,
    month TEXT 
)
"""

# Запускаем команду создания таблицы
cursor.execute(create_names_table)

# Фиксируем изменения
connection.commit()

## Вставка данных в таблицу

In [35]:
# Оператор SQL для вставки данных в таблицу 
insert_data = """
INSERT INTO names (id, name, number_of_persons, global_id, year, month)
VALUES (1, 'Мария', 252, 37750254, 2015, 'январь')
"""

# Запускаем команду вставки данных
cursor.execute(insert_data)

# Фиксируем изменения
connection.commit()

## Запрос данных из таблицы

In [7]:
# Запрос SQL для извлечения данных из таблицы names
select_data = "SELECT * FROM names"

# Запускаем запрос получения данных
cursor.execute(select_data)

# Получаем результаты запроса
resuls = cursor.fetchall()

# Печатаем результаты
for row in resuls:
    print(row)

(1, 'Мария', 252, 37750254, 2015, 'январь')
(2, 'Анастасия', 224, 37750255, 2015, 'январь')
(1, 'Мария', 252, 37750254, 2015, 'январь')

## Завершение работы

In [8]:
# Закрываем курсор
cursor.close()

In [82]:
# Закрываем соединение
connection.close()

## Изменение данных в таблице

In [10]:
# Создание соединения
connection = sqlite3.connect('test.db')

In [92]:
# Создание курсора
cursor = connection.cursor()

Читаем данные из таблицы

In [93]:
def get_data(cursor, table):
    sql = f"SELECT * FROM {table}"
    cursor.execute(sql)
    return cursor.fetchall()

In [94]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь')]

Добавляем строку в таблицу

In [15]:
# Оператор SQL для вставки данных в таблицу 
insert_data = """
INSERT INTO names (id, name, number_of_persons, global_id, year, month)
VALUES (2, 'Анастасия', 224, 37750255, 2015, 'январь')
"""

# Запускаем команду вставки данных
cursor.execute(insert_data)

# Фиксируем изменения
connection.commit()

In [16]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь'),
 (2, 'Анастасия', 224, 37750255, 2015, 'январь'),
 (1, 'Мария', 252, 37750254, 2015, 'январь'),
 (2, 'Анастасия', 224, 37750255, 2015, 'январь'),
 (2, 'Анастасия', 224, 37750255, 2015, 'январь')]

Изменяем данные в таблице

In [17]:
update_data = """
UPDATE names SET number_of_persons = 250
WHERE id = 2
"""

# Запускаем команду вставки данных
cursor.execute(update_data)

# Фиксируем изменения
connection.commit()

In [18]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (1, 'Мария', 252, 37750254, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь')]

Изменяем несколько строк

In [19]:
update_data = """
UPDATE names SET number_of_persons = 255
WHERE name = 'Мария'
"""

# Запускаем команду изменения данных
cursor.execute(update_data)

# Фиксируем изменения
connection.commit()

In [20]:
get_data(cursor, 'names')

[(1, 'Мария', 255, 37750254, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (1, 'Мария', 255, 37750254, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь')]

Удаляем данные

In [21]:
delete_data = """
DELETE FROM names 
WHERE name = 'Мария'
"""

# Запускаем команду удаления данных
cursor.execute(delete_data)

# Фиксируем изменения
connection.commit()

In [22]:
get_data(cursor, 'names')

[(2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь')]

## Работа с транзакциями

In [23]:
delete_data = "DELETE FROM names" 

# Запускаем команду удаления данных
cursor.execute(delete_data)

In [24]:
get_data(cursor, 'names')

[]

In [25]:
# Отменяем транзакцию
connection.rollback()

In [26]:
get_data(cursor, 'names')

[(2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь'),
 (2, 'Анастасия', 250, 37750255, 2015, 'январь')]

## Безопасность: SQL инъекции

In [27]:
def get_data2(cursor, table):
    sql = f"SELECT * FROM {table}"
    cursor.executescript(sql)
    return cursor.fetchall()

In [28]:
# SQL инъекция - удаление таблицы
get_data2(cursor, 'names; DROP TABLE names;')

[]

Получаем список таблиц в базе SQLite

In [29]:
list_tables = """
SELECT
    name
FROM
    sqlite_master
WHERE
    type ='table' AND
    name NOT LIKE 'sqlite_%'
"""

cursor.execute(list_tables)

cursor.fetchall()

[]

In [36]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь'),
 (1, 'Мария', 252, 37750254, 2015, 'январь')]

## Связывание значений (bind values)

In [37]:
# Запрос с параметром
sql = "SELECT * FROM names WHERE name = ?"

In [38]:
cursor.execute(sql, ['Мария'])

cursor.fetchall()

[(1, 'Мария', 252, 37750254, 2015, 'январь'),
 (1, 'Мария', 252, 37750254, 2015, 'январь')]

In [39]:
cursor.execute(sql, ['Анастасия'])

cursor.fetchall()

[]

## Вставка нескольких строк в таблицу

In [44]:
# Оператор SQL для вставки данных в таблицу 
insert_several_rows = """
INSERT INTO names (id, name, number_of_persons, global_id, year, month)
VALUES (3, 'Анна', 190, 37750256, 2015, 'январь'),
       (4, 'Варвара', 190, 37750257, 2015, 'январь'),
       (5, 'Виктория', 186, 37750258, 2015, 'январь')
"""

In [45]:
# Запускаем команду вставки данных
cursor.execute(insert_several_rows)

# Фиксируем изменения
connection.commit()

In [46]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь'),
 (1, 'Мария', 252, 37750254, 2015, 'январь'),
 (3, 'Анна', 190, 37750256, 2015, 'январь'),
 (4, 'Варвара', 190, 37750257, 2015, 'январь'),
 (5, 'Виктория', 186, 37750258, 2015, 'январь')]

Связывание переменных

In [55]:
# Подготавливаем запрос с параметрами
insert_several_rows_parameters = """
INSERT INTO names (id, name, number_of_persons, global_id, year, month)
VALUES (?, ?, ?, ?, ?, ?)
"""

In [58]:
# Значения для параметров запроса
rows = [
    (483, 'Амелия', 8, 62367755, 2015, 'май'),
    (484, 'Камила', 8, 62367756, 2015, 'май')
]

In [59]:
# Запускаем команду вставки нескольких элементов данных
cursor.executemany(insert_several_rows_parameters, rows)

# Фиксируем изменения
connection.commit()

In [60]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь'),
 (1, 'Мария', 252, 37750254, 2015, 'январь'),
 (3, 'Анна', 190, 37750256, 2015, 'январь'),
 (4, 'Варвара', 190, 37750257, 2015, 'январь'),
 (5, 'Виктория', 186, 37750258, 2015, 'январь'),
 (483, 'Амелия', 8, 62367755, 2015, 'май'),
 (484, 'Камила', 8, 62367756, 2015, 'май'),
 (483, 'Амелия', 8, 62367755, 2015, 'май'),
 (484, 'Камила', 8, 62367756, 2015, 'май')]

Связывание переменных через словарь

In [61]:
rows = [
    {'id': 483, 
     'name': 'Евангелина', 
     'number_of_persons': 8, 
     'global_id': 62367757, 
     'year': 2015, 
     'month': 'май'},
    {'id': 486, 
     'name': 'Альбина', 
     'number_of_persons': 8, 
     'global_id': 62367758, 
     'year': 2015, 
     'month': 'май'}
]

In [62]:
# Подготавливаем запрос с именованными параметрами
insert_several_rows_parameters = """
INSERT INTO names (id, name, number_of_persons, global_id, year, month)
VALUES (:id, :name, :number_of_persons, :global_id, :year, :month)
"""

In [63]:
# Запускаем команду вставки нескольких элементов данных
cursor.executemany(insert_several_rows_parameters, rows)

# Фиксируем изменения
connection.commit()

In [64]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь'),
 (1, 'Мария', 252, 37750254, 2015, 'январь'),
 (3, 'Анна', 190, 37750256, 2015, 'январь'),
 (4, 'Варвара', 190, 37750257, 2015, 'январь'),
 (5, 'Виктория', 186, 37750258, 2015, 'январь'),
 (483, 'Амелия', 8, 62367755, 2015, 'май'),
 (484, 'Камила', 8, 62367756, 2015, 'май'),
 (483, 'Амелия', 8, 62367755, 2015, 'май'),
 (484, 'Камила', 8, 62367756, 2015, 'май'),
 (483, 'Евангелина', 8, 62367757, 2015, 'май'),
 (486, 'Альбина', 8, 62367758, 2015, 'май')]

## Ограничения целостности

In [65]:
# Удаляем таблицу names
cursor.execute("DROP TABLE names")

# Фиксируем изменения
connection.commit()

In [66]:
# Оператор SQL для создания таблицы
create_names_table = """
CREATE TABLE IF NOT EXISTS names(
    id INTEGER,
    name TEXT,
    number_of_persons INTEGER,
    global_id INTEGER PRIMARY KEY,
    year INTEGER,
    month TEXT 
)
"""

# Запускаем команду создания таблицы
cursor.execute(create_names_table)

# Фиксируем изменения
connection.commit()

In [69]:
# Оператор SQL для вставки данных в таблицу 
insert_data = """
INSERT INTO names (id, name, number_of_persons, global_id, year, month)
VALUES (1, 'Мария', 252, 37750254, 2015, 'январь')
"""

# Запускаем команду вставки данных
cursor.execute(insert_data)

# Фиксируем изменения
connection.commit()

IntegrityError: UNIQUE constraint failed: names.global_id

In [100]:
get_data(cursor, 'names')

[(1, 'Мария', 252, 37750254, 2015, 'январь')]

## Исключения

In [70]:
cursor.execute("SELECT * FROM table1")

OperationalError: no such table: table1

In [71]:
cursor.execute("DROP TABLE table1")

OperationalError: no such table: table1

In [72]:
cursor.execute("SELECT first_name, last_name FROM names")

OperationalError: no such column: first_name

In [73]:
connection = sqlite3.connect('d:\\new_test.db')

OperationalError: unable to open database file

Обработка исключений

In [74]:
from sqlite3 import Error

In [75]:
# Оператор SQL для вставки данных в таблицу 
insert_data = """
INSERT INTO names (id, name, number_of_persons, global_id, year, month)
VALUES (1, 'Мария', 252, 37750254, 2015, 'январь')
"""

try:
    # Запускаем команду вставки данных
    cursor.execute(insert_data)
    # Фиксируем изменения
    connection.commit()
    print("Запрос выполнен успешно")
except Error as e:
    print(f"Ошибка при выполнении запроса: {e}")

Ошибка при выполнении запроса: UNIQUE constraint failed: names.global_id

## Загрузка данных в базу из JSON файла

In [101]:
# Подключение к базе данных test.db 
connection = sqlite3.connect('test.db')